app/views/hospitals/_hospital_grade.html.erb

              <span id="hospital_grade_text">
                <%= @hospital.avg_grade.round(1) %>점 | <%= @hospital.reviews.count%>명
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."hospital_id" = ?  [["hospital_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."hospital_id" = ?  [["hospital_id", 1]]