app/controllers/hospitals_controller.rb

	def map
		@hospitals = Hospital.all
---
SELECT "hospitals".* FROM "hospitals"