app/controllers/hospitals_controller.rb

SELECT  "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = ? LIMIT 1  [["id", 1]]
SELECT "hospitals".* FROM "hospitals"
SELECT "meetings".* FROM "meetings" WHERE "meetings"."hospital_id" = ?  [["hospital_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."hospital_id" = ?  [["hospital_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."hospital_id" = ?  [["hospital_id", 1]]
---
	def show
		@hospital = Hospital.find(params[:id])
		#@meetings = Meeting.all
		@meetings = @hospital.meetings.all

		@reviews = @hospital.reviews.all

		@hospital.avg_grade = 0

		@reviews.each do|review|
			@hospital.avg_grade += review.grade
		end

		if @reviews.count == 0

SELECT "hospitals".* FROM "hospitals"
SELECT "reviews".* FROM "reviews" WHERE "reviews"."hospital_id" = ?  [["hospital_id", 1]]
UPDATE "hospitals" SET "avg_grade" = ?, "updated_at" = ? WHERE "hospitals"."id" = ?  [["avg_grade", 0.0], ["updated_at", "2015-10-08 06:45:16.905700"], ["id", 5]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."hospital_id" = ?  [["hospital_id", 1]]
---
	def index
	  @hospitals = Hospital.all
	  @hospitals.each do |hospital|
	     @reviews = hospital.reviews.all

	     hospital.avg_grade = 0
	     hospital.save
	     @reviews.each do|review|
	        hospital.avg_grade += review.grade
	        hospital.save
	     end

	     if @reviews.count == 0