app/controllers/meetings_controller.rb

  def create
    @hospital = Hospital.find(params[:hospital_id])
    @meeting = @hospital.meetings.build(meeting_params)
    respond_to do |format|
      if @meeting.save
---
SELECT  "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = ? LIMIT 1  [["id", 9]]
INSERT INTO "meetings" ("name", "start_time", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "동물병원"], ["start_time", "2015-09-14 02:55:00.000000"], ["created_at", "2015-09-14 02:57:30.329413"], ["updated_at", "2015-09-14 02:57:30.329413"]]

  def destroy
    @meeting.destroy
---
DELETE FROM "meetings" WHERE "meetings"."id" = ?  [["id", 3]]

    def set_meeting
      @meeting = Meeting.find(params[:id])
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT 1  [["id", 3]]