app/controllers/reviews_controller.rb

  def create
    @hospital = Hospital.find(params[:hospital_id])
    @review = @hospital.reviews.build(review_params)
    if(params[:review][:grade] == "★")
      @review.grade = 1
      @review.save
---
SELECT  "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("r_content", "grade", "hospital_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["r_content", "그저그렇네요 뭐"], ["grade", 2.0], ["hospital_id", 1], ["created_at", "2015-10-08 06:45:50.228472"], ["updated_at", "2015-10-08 06:45:50.228472"]]

  def destroy
    @hospital = Hospital.find(params[:hospital_id])
    @review = @hospital.reviews.find(params[:id])
    @review.destroy
---
SELECT  "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."hospital_id" = ? AND "reviews"."id" = ? LIMIT 1  [["hospital_id", 1], ["id", 28]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 28]]